In [ ]:
import pandas as pd
import seaborn as sns
import matplotlib as plt

In [ ]:
data_location = "../melb_data (2).csv"

data = pd.read_csv(data_location)

data

In [ ]:
print("Descripcion estadistica:")
print(data.describe())

In [ ]:
print("Informacion del dataset:")
print(data.info())

In [ ]:
print("Conteo de valores unicos:")
print(data.Rooms.value_counts())

In [ ]:
print(data.isnull().sum())

In [ ]:
selected_columns = ["Rooms", "Price", "Bathroom", "Bedroom2", "Landsize"]
data2 = data[selected_columns]
data2

In [ ]:
correlation_matrix = data2.corr()
print(correlation_matrix)

In [ ]:
data.head(3)

In [ ]:
data.tail(3)

In [ ]:
is_null_result = data.isnull()
print(is_null_result.head(3))

In [ ]:
is_notnull_result = data.notnull()
print(is_notnull_result.head(3))

In [ ]:
cant_nulls = is_null_result.sum()
print(cant_nulls)

In [ ]:
data_columnas_completas = data.dropna(axis=1)
print(data.shape)
print(data_columnas_completas.shape)

In [ ]:
data_filas_completas = data.dropna(axis=0)
print(data.shape)
print(data_filas_completas.shape)

In [ ]:
pd.value_counts(data.Car)

In [ ]:
data_car_2_mask = data.Car == 2
data_car_2_fill = data.Car.fillna(2)
data_car_null_mask = data.Car.isnull()
data_car_null_count = data_car_null_mask.sum()
print(data_car_null_count)

In [ ]:
data_car_2_fill = data.Car.fillna(2)

In [ ]:
data["Car_fill"] = data_car_2_fill

In [ ]:
data_car_2_mask = data.Car == 2
data_car_2_count= data_car_2_mask.sum()
print(data_car_2_count)
data_car_2_fill = data.Car.fillna(2)
data_car_null_mask = data.Car_fill.isnull()
data_car_null_count = data_car_null_mask.sum()
print(data_car_null_count)

In [39]:
precio_m2=data.apply(lambda x: 0 if x["Landsize"]==0 else x["Price"]/x["Landsize"], axis=1)
precio_m2.head(5)

0     7326.732673
1     6634.615385
2    10932.835821
3     9042.553191
4    13333.333333
dtype: float64

In [41]:
df = pd.DataFrame({"A":[0,1,2,3,4],
                   "B":[5,6,7,8,9],
                   "C":["a","b", "c", "d", "e"]})
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [42]:
df.replace(0,5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [43]:
df.replace({"A":0, "B":5},10000)

       A      B  C
0  10000  10000  a
1      1      6  b
2      2      7  c
3      3      8  d
4      4      9  e

In [44]:
df.replace({"A":{0:100, 4:1000}})

      A  B  C
0   100  5  a
1     1  6  b
2     2  7  c
3     3  8  d
4  1000  9  e

In [45]:
import numpy as np
from sklearn.preprocessing import LabelEncoder, OrdinalEncoder, OneHotEncoder

In [46]:
rng = np.random.default_rng()

a_values = rng.integers(low=0, high=100, size=10)
b_values = rng.integers(low=100, high=500, size=10)

data = pd.DataFrame({"a":a_values, "b":b_values})
data

    a    b
0  88  340
1  49  448
2  31  151
3  56  128
4  17  176
5  22  309
6  56  369
7  85  381
8  65  348
9  16  329

In [ ]:
data.a.describe()

count    10.000000
mean     48.500000
std      26.529857
min      16.000000
25%      24.250000
50%      52.500000
75%      62.750000
max      88.000000
Name: a, dtype: float64

In [48]:
data.b.describe()

count     10.000000
mean     297.900000
std      108.099183
min      128.000000
25%      209.250000
50%      334.500000
75%      363.750000
max      448.000000
Name: b, dtype: float64

In [51]:
bins = [0,30,40,50,60,100]
a_categories = pd.cut(data.a,bins,right=False)
a_categories.dtype

a_categories = pd.cut(data.a, [0,30,40,50,60,100], right=False)
a_categories.dtype

CategoricalDtype(categories=[[0, 30), [30, 40), [40, 50), [50, 60), [60, 100)], ordered=True, categories_dtype=interval[int64, left])

In [55]:
group_labels = ["demasiado poco", "poco", "normal", "mucho", "demasiado"]
a_categories_labels = pd.cut(data.a, bins, labels=group_labels)
a_categories_labels.value_counts()

a
demasiado poco    3
demasiado         3
mucho             2
normal            1
poco              1
Name: count, dtype: int64

In [57]:
categories=["gato", "perro", "raton", "elefante", "tigre", "leon"]
data["category"]=rng.choice(categories, size=10)
data["size"]=rng.choice(["pequeño","mediano", "grande"], size=10)
data["color"]=rng.choice(["rojo","azul","verde"], size=10)
print(data)

    a    b  category     size  color
0  88  340  elefante  mediano   rojo
1  49  448      leon   grande   azul
2  31  151     raton  mediano  verde
3  56  128     raton   grande   azul
4  17  176     perro   grande   rojo
5  22  309  elefante  pequeño  verde
6  56  369      leon  mediano   rojo
7  85  381     tigre  mediano   rojo
8  65  348     perro  pequeño  verde
9  16  329     tigre  pequeño   azul

In [59]:
label_encoder=LabelEncoder()
data["category_encoded"]=label_encoder.fit_transform(data["category"])
print(data)

    a    b  category     size  color  category_encoded
0  88  340  elefante  mediano   rojo                 0
1  49  448      leon   grande   azul                 1
2  31  151     raton  mediano  verde                 3
3  56  128     raton   grande   azul                 3
4  17  176     perro   grande   rojo                 2
5  22  309  elefante  pequeño  verde                 0
6  56  369      leon  mediano   rojo                 1
7  85  381     tigre  mediano   rojo                 4
8  65  348     perro  pequeño  verde                 2
9  16  329     tigre  pequeño   azul                 4

In [61]:
ordinal_encoder=OrdinalEncoder(categories=[["pequeño", "mediano", "grande"]])
data["size_encoded"]=ordinal_encoder.fit_transform(data[["size"]])
print(data)

    a    b  category     size  color  category_encoded  size_encoded
0  88  340  elefante  mediano   rojo                 0           1.0
1  49  448      leon   grande   azul                 1           2.0
2  31  151     raton  mediano  verde                 3           1.0
3  56  128     raton   grande   azul                 3           2.0
4  17  176     perro   grande   rojo                 2           2.0
5  22  309  elefante  pequeño  verde                 0           0.0
6  56  369      leon  mediano   rojo                 1           1.0
7  85  381     tigre  mediano   rojo                 4           1.0
8  65  348     perro  pequeño  verde                 2           0.0
9  16  329     tigre  pequeño   azul                 4           0.0

In [62]:
data = pd.DataFrame({"category":["gato","perro","raton", "perro"]})
print(data)

  category
0     gato
1    perro
2    raton
3    perro

In [63]:
one_hot_encoder = OneHotEncoder(sparse_output=False)
one_hot_encoded = one_hot_encoder.fit_transform(data[["category"]])
one_hot_encoded_df=pd.DataFrame(one_hot_encoded, columns=one_hot_encoder.get_feature_names_out(["category"]))
print(one_hot_encoded_df)

   category_gato  category_perro  category_raton
0            1.0             0.0             0.0
1            0.0             1.0             0.0
2            0.0             0.0             1.0
3            0.0             1.0             0.0

In [64]:
data_combined = pd.concat([data,one_hot_encoded_df],axis=1)
print(data_combined)

  category  category_gato  category_perro  category_raton
0     gato            1.0             0.0             0.0
1    perro            0.0             1.0             0.0
2    raton            0.0             0.0             1.0
3    perro            0.0             1.0             0.0